{"itemType":"WEAPON","rarity":"LEGENDARY","requiresAttunement":true,"hasCharges":false,"type":"ITEM","title":"An Actual Real Knife","author":"W0mped","link":"https://www.dndbeyond.com/magic-items/5939408-an-actual-real-knife","tags":[],"content":["This is an actual real world knife. This weapon cannot be given any enchantments, infusions or any other modification that would alter the knife. The damage dealt by this weapon bypasses all resistances and immunities.","To attune to this item, you must succeed a DC 20 Constitution Saving Throw or be knocked unconscious by the strain this weapon puts on the Fourth Wall. Only one creature can attempt to attune to this item per day. Once a creature is successfully attuned to the knife, it must make a Wisdom Saving Throw every dawn. The DC for this Saving Throw is equal to the number of days the creature has been attuned to the knife. On a failure, the creature gains 1 level of exhaustion. On a success, the creature just feels an overwhelming sense of dread.","You can use your action to make a melee attack against a creature with the knife. On a hit, it deals 10d10 psychic damage, as the mental anguish of being actually stabbed by a real knife shatters the creature\u0027s perception of reality. Additionally, the first time a creature is hit by the knife, it must make a DC 15 Constitution Saving throw. On a failure, the creature begins to bleed out, taking 1d10 psychic damage at the start of each of its turns and be poisoned for the next minute. It can repeat this save at the end of each of its turns, a successful save ending the bleeding and the poisoned condition. The bleeding can only be applied once per creature until the creature has stopped bleeding.","When you roll a Natural 1 to hit with the knife, you become petrified until the start of your next turn.","Proficiency with a shortsword allows you to add your proficiency bonus to the attack roll for any attack you make with it.","Notes: Damage: Psychic, Damage: Psychic, Poisoned, Petrified, Exhaustion, Finesse, Light"]}