{"itemType":"ARMOR","rarity":"ARTIFACT","requiresAttunement":true,"hasCharges":false,"type":"ITEM","title":"Armor of Inner Darkness","author":"Yorick Null","link":"https://www.dndbeyond.com/magic-items/5645290-armor-of-inner-darkness","tags":[],"content":["Armor of Inner Darkness ","Armor (plate), artifact (requires attunement)","It is said that the Armor of Inner Darkness was created by a long dead conqueror whose name has been forgotten by time. Others say that the nameless conqueror was merely one of countless hosts to the armor, and in reality the it predates the conqueror by countless millennia. In truth, not even the gods know the true origin of the Armor of Inner Darkness. ","What is known is that the armor has been worn by countless heroes and villains throughout history, all of whom were ultimately transformed into savage beasts by it. The armor manifests an incredible bloodlust in its wearer, as it brings every negative feeling within their soul to the surface, and amplifies them to the point that they consume the their mind.  ","When a new wearer dons the armor, they are immediately considered to be attuned to it. If the wearer already has all of their attunement slots filled, attunement to one of the items of the wearer\u0027s choice is broken. ","The Armor of Inner Darkness\u0027 appearance transforms into a shape befitting the darkest parts of the wearer\u0027s soul. When you attune to this armor you determine its appearance by choosing one of the following forms to represent your character (or creating your own).","1\tThe armor\u0027s helm takes on a skull-like visage to represent the undying avarice of the wearer.","2\tThe armor begins to sprout thorns in every conceivable direction, as a fitting representation of the wearer\u0027s murderous tendencies, as even brushing against them can cause wounds.","3\tA feathered cape drapes from the armor\u0027s shoulders, and the helmet takes on an appearance like a vulture. Perhaps to illustrate the wearer\u0027s opportunism in the face of the death and suffering of others.","4\tTusks like that of a boar begin to jut from the armor\u0027s helm. A reference to the wearer\u0027s hardheadedness, and dogged disregard for the wellbeing of others in favor of their own boorish pursuits.","5\tA perverse, toothy grin appears across the breastplate of the armor. A confirmation that despite the atrocities that the wearer has committed, and the fact that they are slowly losing their mind, they are enjoying every minute of it.","6\tCountless eyes appear all over the armor\u0027s form. A manifestation of the wearer\u0027s paranoia.","7\tThe armor is inexplicably coated in a slippery black liquid, turning the wearer\u0027s into an oily, formless figure. Whose to say what eldritch depths of the wearer\u0027s soul caused the armor to transform into this.","8\tThe armor takes on a demonic, hound-like appearance. Perhaps the represents the wearer\u0027s resemblance to a feral dog, too broken and abused to trust others. "," ","Random Properties.","The Armor of Inner Darkness has the following random properties:","1 minor beneficial properties","1 major beneficial property","2 minor detrimental properties","1 major detrimental property","Adjusted Ability Scores.","When you attune to the Armor of Inner Darkness, choose one of the following ability scores of your choice to increase by 4 to a maximum of 24: Strength, Dexterity, or Constitution. The armor can not adjust your ability scores again.  ","Unbridled Bloodlust.","As an action, you can enter an beast-like, unbridled bloodlust while wearing this armor. This lasts until you die, or until it is forcibly ended. You gain the following features:","You are immune to the frightened and charmed conditions.","Having 0 hit points doesn\u0027t knock you unconscious, and you do not make death saving throws. Instead, any damage that is leftover is dealt to your hit point maximum. A creature that has their hit point maximum reduced to 0 in this way dies and can\u0027t be revived by any means short of a wish spell. For example, a fighter with a maximum of 80 hit points has 5 hit points remaining. If she takes 35 damage from an attack, she is reduced to 0 hit points by that attack, but she remains conscious and can act normally. The additional 30 damage that she has taken carries over to her hit point maximum. She now has a hit point maximum of 50. The reduction lasts until the target finishes 1d4+1 long rests.","When an enemy makes a melee attack against you, hit or miss, you can make a melee weapon attack against them as a reaction. You must take this reaction if you are able to do so.","You can not regain hit points or be stabilized by any means.","You lose the ability to distinguish between friend and foe. You must use your action either to take the attack action against a creature within 5 feet of you, or to dash towards the nearest creature that you can see.","Ending the Bloodlust.","A creature that has entered an unbridled bloodlust is utterly out of control, and must rely on their allies to pull them out of their fervor. If Calm Emotions, Remove Curse, or a similar spell is cast against a creature that is under the effects of Unbridled Bloodlust, that creature can choose to make a DC 20 wisdom saving throw. On a failure, the wearer is unaffected. On a success, the bloodlust ends, and the wearer immediately drops to 0 hit points and goes unconscious. ","Plate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body.","Notes: Str 15 Required, Stealth Disadvantage"]}