{"itemType":"RING","rarity":"LEGENDARY","requiresAttunement":true,"hasCharges":false,"type":"ITEM","title":"Ouroboros Ring(s)","author":"Gladyhedral","link":"https://www.dndbeyond.com/magic-items/5945352-ouroboros-ring-s","tags":[],"content":["Ouroboros Ring(s) ","Ring, legendary (requires attunement)","This pair of magic rings each take the form of an ouroboros the eyes of which are set with precious gems. When creatures attuned to matching sets of rings touch and speak a command word the ring transforms both users and merges them into one creature. The transformation depends on the kind of gem set into the eyes of the serpents. This set, containing Emerald Eyes, transforms the users into a Steel Predator.  The transformation lasts for 1 minute or until targeted by Dispel Magic, Remove Curse, or similar magic. ","When transformed in this way you retain your place in initiative, and both characters participating in the steam formation take a turn as the Steel Predator. Your game statistics are replaced by the statistics of the Steel Predator, but you retain your alignment, personalities, and Intelligence, Wisdom, and Charisma scores. You also retain your skill and saving throw proficiencies in addition to gaining those of the Steel Predator. ","When you transform you both assume the hit points and Hit Dice in a shared pool. You automatically revert if you are rendered unconscious, drop to 0 hit points, or die. When you revert to your normal form you return to the number of hit points you had before you transformed. As a result of dropping to 0 hit points any excess damage carries over to your normal form and is split evenly between the two of you. ","You cannot cast spells in this form, and you lose concentration on any spell cast before transforming. You retain your ability to speak, but your characters speak in unison. Whichever character is currently in command of the body controls what is said aloud.","You share the transformation’s spell slots. You also share the recharge properties of any abilities the transformation has. For example, the Steel Predator’s Stunning Roar ability is used on one partner’s turn then the next partner may roll to recharge the ability. ","The rings can be used to merge and transform in this way only once per day, recharging the ability each dawn. ","Notes: Shapechanging, Handwear, transmutation"]}