{"itemType":"WONDEROUS_ITEM","rarity":"UNCOMMON","requiresAttunement":true,"hasCharges":false,"type":"ITEM","title":"Boots of the Guilty","author":"Dalcassius","link":"https://www.dndbeyond.com/magic-items/5767296-boots-of-the-guilty","tags":[],"content":["Boots of the Guilty ","Wondrous Item, uncommon (requires attunement by a character of any class or race)","For purposes of clarity, anyone who attunes to the boots become, and are refered to as, the owner and the wearer interchangeably. This is because the effects do not require the boots to always be worn, thus wearer does not always apply. Where wearer is used, wearing the boots is obviously required.","A sturdy, if slightly beat up, pair of black leather boots. On the toe of one boot is a blood stain which, regardless of effort and method, cannot be removed. Hidden in a tucked away seam of each boot is concealed stitching in gold thread which spells a name.","This cursed pair of boots from the corpse of a guilty murderer bears that person\u0027s name. The purpose of these boots is to cause misfortune and havoc while the owner sleeps or the boots are otherwise unattended, framing the owner for crimes, hiding or sabotaging equipment; anything to attempt to get the owner in serious trouble with the law, their friends, their enemies, or to cause injury, up to and including the death of the owner.","While up to their misdeeds, the boots become worn by the physically manifested spirit of the murderer they were taken from. Though able to act intelligently and with creativity, this spirit is not sentient and does not possess free-will. The boots are an extension of this spirit, who is capable of any mundane action a normal medium sized mortal humanoid is capable of, though they are driven by extreme malice towards the owner of the boots. DM\u0027s should feel free to create an appropriate NPC stat block for their story, otherwise, use the Spy stat block from page 349 of the Monster Manual with the following changes. AC 10. HP 1 (if the spirit is reduced to 0 HP it cannot manifest for 1d4 hours.) The spirit cannot attack and will always seek to flee or hide, including to disperse and appear as discarded boots then re-manifesting at a more opportune time.","The attuned wearer of the boots has advantage on Dexterity (Stealth) checks to move into an adjacent square of a target. After ending their movement adjacent to the target, if the wearer makes a successful attack against that target, they can choose to change the success to be a critical hit instead. The wearer can only make one attack a critical hit until they complete a short or long rest.","In any round in which the advantage to Dexterity (Stealth) feature is used and a melee attack is not made against the adjacent target by the wearer, the wearer has their movement reduced to 0 feet until the end of their next turn. In addition, all enemies within 30ft of the wearer become aware of the wearers exact location. The attack does not need to be successful nor changed to be a critical to meet the criteria to avoid this penalty.","The soles of the boots create a unique and easily identifiable imprint, giving advantage to anyone attempting to track the wearer, be it the owner or the manifested spirit. The owner is incapable of noticing the uniqueness of the prints and the advantage it provides to tracking them. The spirit is aware and will use this to aid it\u0027s efforts to harm the owner.","Anyone who attunes to the Boots of the Guilty becomes the defacto owner of them, and cannot unattune them. While attuned to someone, no one else is able to attune to them, or make use of their magical benefits, and is not subject to their curse. To lose ownership of the boots, one must either die or break the curse by delivering some form of justice to any one of the murderers victims, which may require some amount of creativity as the murderer has already been sent to their eternal reward.","Notes: character of any class or race"]}